In [2]:
import numpy as np

In [3]:
import pandas as pd

### Creating a Series by converting a list, dictionary, array to a Series

In [4]:
labels = ['a','b','c']
my_list = [10,20,30]
arr = np.array([10,20,30])
d = {'a':10,'b':20, 'c':30}

In [5]:
pd.Series(data = my_list)

0    10
1    20
2    30
dtype: int64

In [6]:
pd.Series(data=my_list, index = labels)

a    10
b    20
c    30
dtype: int64

In [9]:
pd.Series(my_list, labels)

a    10
b    20
c    30
dtype: int64

In [10]:
pd.Series(my_list)

0    10
1    20
2    30
dtype: int64

In [12]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [15]:
pd.Series(data = labels, index = [1,2,3])

1    a
2    b
3    c
dtype: object

In [16]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int32

In [17]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int32

### Using a Series
#### The key to using a series effectively in pandas is understanding its index. Pandas makes use of index names or numbers by allowing for fast lookups of information(i.e it works like a dictionary or hashtable)

In [18]:
pd.Series([1,2,3,4], index=['USA','RUSSIA','GERMANY','UK'])

USA        1
RUSSIA     2
GERMANY    3
UK         4
dtype: int64

In [19]:
countrySeries = pd.Series([1,2,3,4], index=['USA','RUSSIA','GERMANY','UK'])

In [20]:
countrySeries

USA        1
RUSSIA     2
GERMANY    3
UK         4
dtype: int64

In [21]:
countrySeries[1]

2

In [22]:
nationalGDP = pd.Series([2,5,6,8], index=['USA','MOROCCO', 'RUSSIA','GERMANY'])

In [23]:
nationalGDP

USA        2
MOROCCO    5
RUSSIA     6
GERMANY    8
dtype: int64

In [24]:
countrySeries + nationalGDP

GERMANY    11.0
MOROCCO     NaN
RUSSIA      8.0
UK          NaN
USA         3.0
dtype: float64

# DATAFRAMES

DataFrames are the workhorse of pandas and are directly inspired by the R programming language. We can think of a DataFrame as a bunch of Series objects put together to share the same index.

In [32]:
import numpy as np
from numpy.random import randn
np.random.seed(101)
pd.DataFrame(randn(5,4))

          0         1         2         3
0  2.706850  0.628133  0.907969  0.503826
1  0.651118 -0.319318 -0.848077  0.605965
2 -2.018168  0.740122  0.528813 -0.589001
3  0.188695 -0.758872 -0.933237  0.955057
4  0.190794  1.978757  2.605967  0.683509

In [30]:
pd.DataFrame(randn(5,4))

          0         1         2         3
0  0.302665  1.693723 -1.706086 -1.159119
1 -0.134841  0.390528  0.166905  0.184502
2  0.807706  0.072960  0.638787  0.329646
3 -0.497104 -0.754070 -0.943406  0.484752
4 -0.116773  1.901755  0.238127  1.996652

In [33]:
df = pd.DataFrame(randn(5,4), index = 'A B C D E'.split(), columns='W X Y Z'.split())

In [34]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

## Selection and Indexing
#### Understanding the various methods of grabbing data from a dataframe

In [35]:
df['W']

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: W, dtype: float64

### To Access more than one column, you can do so by entering a list into the parentheses

In [36]:
df[['W','X']]

          W         X
A  0.302665  1.693723
B -0.134841  0.390528
C  0.807706  0.072960
D -0.497104 -0.754070
E -0.116773  1.901755

In [37]:
df[['W','Z']]

          W         Z
A  0.302665 -1.159119
B -0.134841  0.184502
C  0.807706  0.329646
D -0.497104  0.484752
E -0.116773  1.996652

In [38]:
df['added'] = df['W'] + df ['Z']
# creating a new column using data from exisiting columns

In [39]:
df

          W         X         Y         Z     added
A  0.302665  1.693723 -1.706086 -1.159119 -0.856454
B -0.134841  0.390528  0.166905  0.184502  0.049661
C  0.807706  0.072960  0.638787  0.329646  1.137352
D -0.497104 -0.754070 -0.943406  0.484752 -0.012352
E -0.116773  1.901755  0.238127  1.996652  1.879879

#### Removing columns

In [42]:
df.drop(['added', 'X'], axis=1)

          W         Y         Z
A  0.302665 -1.706086 -1.159119
B -0.134841  0.166905  0.184502
C  0.807706  0.638787  0.329646
D -0.497104 -0.943406  0.484752
E -0.116773  0.238127  1.996652

#### The sort of removal done above just removes the specified dataset on the fly, not inplace unless specified

In [43]:
df

#This shows that the new column is still there

          W         X         Y         Z     added
A  0.302665  1.693723 -1.706086 -1.159119 -0.856454
B -0.134841  0.390528  0.166905  0.184502  0.049661
C  0.807706  0.072960  0.638787  0.329646  1.137352
D -0.497104 -0.754070 -0.943406  0.484752 -0.012352
E -0.116773  1.901755  0.238127  1.996652  1.879879

In [44]:
df.drop('added', axis=1, inplace=True)

#### This removal done above totally removes it from the dataset by setting inplace = True

In [45]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

#### Rows can be dropped this way, on the fly

In [46]:
df.drop('E', axis = 0)

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752

In [47]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

### Selecting rows

In [48]:
df.loc['A']

W    0.302665
X    1.693723
Y   -1.706086
Z   -1.159119
Name: A, dtype: float64

In [49]:
df.iloc[2]
# df
#This selects off of position instead of labels

W    0.807706
X    0.072960
Y    0.638787
Z    0.329646
Name: C, dtype: float64

In [50]:
df.loc['C','Z']

0.32964629880452445

In [51]:
df.loc[['A','B',],['W','Z']]

          W         Z
A  0.302665 -1.159119
B -0.134841  0.184502

## Conditional Selection

An important feature of pandas is conditional selection using bracket notation, very similar to numpy

In [52]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [53]:
df>0

       W      X      Y      Z
A   True   True  False  False
B  False   True   True   True
C   True   True   True   True
D  False  False  False   True
E  False   True   True   True

In [54]:
df > 1

       W      X      Y      Z
A  False   True  False  False
B  False  False  False  False
C  False  False  False  False
D  False  False  False  False
E  False   True  False   True

In [55]:
df[df>0]
# df

          W         X         Y         Z
A  0.302665  1.693723       NaN       NaN
B       NaN  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D       NaN       NaN       NaN  0.484752
E       NaN  1.901755  0.238127  1.996652

In [56]:
df[df['W']>0]

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
C  0.807706  0.072960  0.638787  0.329646

In [60]:
df[df['W']>0]['Y']

A   -1.706086
C    0.638787
Name: Y, dtype: float64

In [62]:
df[df['W']>0][['Y','X']]

          Y         X
A -1.706086  1.693723
C  0.638787  0.072960

#### For more than one condition, use keywords like (&, |) with parenthesis:

In [63]:
df[(df['W']>0)|(df['Y']>1)]

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
C  0.807706  0.072960  0.638787  0.329646

In [64]:
df[(df['W']>0) & (df['Y']>1)]

Empty DataFrame
Columns: [W, X, Y, Z]
Index: []

### More Index Details

In [65]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [66]:
#To reset an already assigned index
df.reset_index()

  index         W         X         Y         Z
0     A  0.302665  1.693723 -1.706086 -1.159119
1     B -0.134841  0.390528  0.166905  0.184502
2     C  0.807706  0.072960  0.638787  0.329646
3     D -0.497104 -0.754070 -0.943406  0.484752
4     E -0.116773  1.901755  0.238127  1.996652

In [67]:
newind = 'CA NY WY OR CO'.split()

In [68]:
df['States'] = newind

In [69]:
df

          W         X         Y         Z States
A  0.302665  1.693723 -1.706086 -1.159119     CA
B -0.134841  0.390528  0.166905  0.184502     NY
C  0.807706  0.072960  0.638787  0.329646     WY
D -0.497104 -0.754070 -0.943406  0.484752     OR
E -0.116773  1.901755  0.238127  1.996652     CO

In [70]:
df.set_index('Y')

                  W         X         Z States
Y
-1.706086  0.302665  1.693723 -1.159119     CA
 0.166905 -0.134841  0.390528  0.184502     NY
 0.638787  0.807706  0.072960  0.329646     WY
-0.943406 -0.497104 -0.754070  0.484752     OR
 0.238127 -0.116773  1.901755  1.996652     CO

In [71]:
df

          W         X         Y         Z States
A  0.302665  1.693723 -1.706086 -1.159119     CA
B -0.134841  0.390528  0.166905  0.184502     NY
C  0.807706  0.072960  0.638787  0.329646     WY
D -0.497104 -0.754070 -0.943406  0.484752     OR
E -0.116773  1.901755  0.238127  1.996652     CO

## Multi-Index and Index Hierarchy

Let us go over how to work with Multi-Index, first we'll create a quick example of what a Multi-Indexed DataFrame would look like:

In [ ]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [ ]:
hier_index

In [ ]:
df = pd.DataFrame(np.random.randn(6,2),index = hier_index, columns = ['A','B'])
df

Now let's show how to index this! For index hierarchy we use df.loc[], if this was on the columns axis, you would just use normal bracket notation df[]. Calling one level of the index returns the sub-dataframe:

In [ ]:
df.loc['G1']

In [ ]:
df.loc['G1'].loc[1]

In [ ]:
df.index.names

In [ ]:
df.index.names = ['Group','Num']

In [ ]:
df

In [ ]:
df.xs('G1')

In [ ]:
df.xs(['G1',1])

In [ ]:
df.xs(1,level='Num')